# 파이썬 코드 실습


# 자료형(리스트, 튜플, 딕셔너리)

# 리스트(List): 순서o, 중복o, 수정o, 삭제o
# 선언


# 인덱싱: 인덱스를 이용해 리스트 안에서 특정한 값을 가져옴


# 슬라이싱: 인덱스를 이용해 일부분을 잘라서 가져옴


# 추가, 수정, 삭제
# 추가: append, extend


# 수정


# 삭제: remove, pop, del


# +a
# 리스트 길이: len
# 정렬: sort



print('----------------------------------------')

# 튜플(Tuple): 순서o, 중복o, 수정x, 삭제x 
# 변경되는 것을 방지하기 위해 중요데이터를 관리할 때 사용
# 선언


print('----------------------------------------')

# 딕셔너리(Dictionary): 순서x, 중복x, 수정o, 삭제o
# Key(변함x), Value(변함o, 변함x)
# 선언


# 추가


# keys, values, items, get(key&value 한쌍)


print('----------------------------------------')

# 조건문(if-else)


print('----------------------------------------')

# 반복문
# 기본 반복문: for, while



# 순서 있는 자료형 반복
# 문자열, 리스트, 튜플, 집합, 사전
# iterable 리턴 함수: range, reversed, enumerate, filter, map, zip


# 기본 값은 키


# keys


# values


# items


# enumerate: 반복 횟수


# break



print('----------------------------------------')

# 예외처리(try-except)



print('----------------------------------------')

# 함수
# 함수 정의 방법
# def 함수명(parameter):
#   code

# 함수 호출
# 함수명(parameter)



# 코드상에서 명시적으로 자료형이나 반환값 힌트를 주기


print('----------------------------------------')

# 모듈
# 함수나 변수 또는 클래스를 모아 놓은 파일

# 선언
# import 모듈이름
# from 모듈이름 import 모듈함수

